Revit 2027 API
RebarFreeFormAccessor.WorkshopInstructions Property
 Identifies the workshop instructions of the current Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarWorkInstructions WorkshopInstructions { get; set; }
Public Property WorkshopInstructions As RebarWorkInstructions
	Get
	Set
public:
property RebarWorkInstructions WorkshopInstructions {
	RebarWorkInstructions get ();
	void set (RebarWorkInstructions value);
}
member WorkshopInstructions : RebarWorkInstructions with get, set
Property Value
RebarWorkInstructions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace